Frontend/echart.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-03-22 周五 01:30 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>EChart</title>
<meta name="generator" content="Org mode">
<meta name="author" content="unname">
<link rel='stylesheet' href='/asset/common.css' />
</head>
<body>
<div id="content">
<header>
<h1 class="title">EChart</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2231c53">1. EChart</a></li>
<li><a href="#orgdda7bae">2. 使用示例</a></li>
</ul>
</div>
</nav>




<section id="outline-container-org2231c53" class="outline-2">
<h2 id="org2231c53"><span class="section-number-2">1</span> EChart</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="http://echarts.baidu.com/index.html">http://echarts.baidu.com/index.html</a>
</p>

<p>
各种实例:
</p>
<ul class="org-ul">
<li><a href="http://echarts.baidu.com/examples/">http://echarts.baidu.com/examples/</a></li>
</ul>

<p>
这是一个使用广泛的图表库，使用 h5 的 canvas 或者 svg 进行绘制渲染。
</p>
</div>
</section>

<section id="outline-container-orgdda7bae" class="outline-2">
<h2 id="orgdda7bae"><span class="section-number-2">2</span> 使用示例</h2>
<div class="outline-text-2" id="text-2">
<p>
首先，准备页面:
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="org-string">&lt;!DOCTYPE html&gt;</span>
&lt;<span class="org-function-name">html</span>&gt;
&lt;<span class="org-function-name">head</span>&gt;
    &lt;<span class="org-function-name">meta</span> <span class="org-variable-name">charset</span>=<span class="org-string">"utf-8"</span>&gt;
    &lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://cdn.bootcss.com/echarts/4.2.0-rc.2/echarts.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;/<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">body</span>&gt;
    &lt;<span class="org-function-name">div</span> <span class="org-variable-name">id</span>=<span class="org-string">"main"</span> <span class="org-variable-name">style</span>=<span class="org-string">"width: 600px;height:400px;"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
    &lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"./yourChart.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;/<span class="org-function-name">body</span>&gt;
&lt;/<span class="org-function-name">html</span>&gt;
</pre>
</div>

<p>
然后，相应的 JS:
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">myChart</span> = echarts.init(document.getElementById(<span class="org-string">'main'</span>));

<span class="org-comment-delimiter">// </span><span class="org-comment">&#26609;&#24418;&#22270;</span>
<span class="org-keyword">var</span> <span class="org-variable-name">bar</span> = {
    title: { text: <span class="org-string">'&#20998;&#25968;&#22270;'</span> },
    tooltip: {},
    legend: { data: [<span class="org-string">'&#20320;'</span>, <span class="org-string">'&#22905;'</span>] },
    xAxis: {
        data: [<span class="org-string">"&#35821;&#25991;"</span>, <span class="org-string">"&#25968;&#23398;"</span>, <span class="org-string">"&#33521;&#35821;"</span>]
    },
    yAxis: {},
    series: [
        {
            name: <span class="org-string">'&#20320;'</span>,
            type: <span class="org-string">'bar'</span>,
            data: [89, 92, 63]
        },
        {
            name: <span class="org-string">'&#22905;'</span>,
            type: <span class="org-string">'bar'</span>,
            data: [68, 91, 89]
        }
    ]
};

<span class="org-comment-delimiter">// </span><span class="org-comment">&#39292;&#24418;&#22270;</span>
<span class="org-keyword">const</span> <span class="org-variable-name">pie</span> = {
    series : [
        {
            name: <span class="org-string">'&#35775;&#38382;&#26469;&#28304;'</span>,
            type: <span class="org-string">'pie'</span>,
            <span class="org-comment-delimiter">// </span><span class="org-comment">roseType: 'angle',</span>
            radius: <span class="org-string">'55%'</span>,
            data:[
                {name:<span class="org-string">'&#35270;&#39057;&#24191;&#21578;'</span>, value:235},
                {name:<span class="org-string">'&#32852;&#30431;&#24191;&#21578;'</span>, value:274},
                {name:<span class="org-string">'&#37038;&#20214;&#33829;&#38144;'</span>, value:310},
                {name:<span class="org-string">'&#30452;&#25509;&#35775;&#38382;'</span>, value:335},
                {name:<span class="org-string">'&#25628;&#32034;&#24341;&#25806;'</span>, value:400}
            ]
        }
    ]
};

<span class="org-comment-delimiter">// </span><span class="org-comment">&#26354;&#32447;&#22270;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">&#21487;&#20197;&#28155;&#21152;&#21508;&#31181;&#32452;&#20214;&#65292;&#27604;&#22914;:</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">&#22270;&#20363;&#32452;&#20214; legend&#12289;&#26631;&#39064;&#32452;&#20214; title&#12289;&#35270;&#35273;&#26144;&#23556;&#32452;&#20214; visualMap&#12289;&#25968;&#25454;&#21306;&#22495;&#32553;&#25918;&#32452;&#20214; dataZoom&#12289;&#26102;&#38388;&#32447;&#32452;&#20214; timeline</span>
<span class="org-keyword">const</span> <span class="org-variable-name">line</span> = {
    title: {
        text: <span class="org-string">'&#26085;&#24120;&#20998;&#25968;&#26354;&#32447;'</span>
    },
    textStyle: {
        color: <span class="org-string">'rgba(255, 255, 255, 0.3)'</span>
    },
    toolbox: {
        feature: {
            dataView: {},
            saveAsImage: { pixelRatio: 2 },
            restore: {}
        }
    },
    visualMap: {
        show: <span class="org-constant">true</span>,
        min: 80,
        max: 600,
        inRange: {
            colorLightness: [0, 1]
        }
    },
    itemStyle: {
        shadowBlur: 200,
        shadowOffsetX: 0,
        shadowOffsetY: 0,
        shadowColor: <span class="org-string">'rgba(0, 0, 0, 0.5)'</span>
    },
    xAxis: {},
    yAxis: {},
    series: [{
        type: <span class="org-string">'line'</span>,
        smooth: <span class="org-constant">true</span>,
        data: [[12, 5], [24, 20], [36, 36], [48, 10], [60, 10], [72, 20]]
    }]
};

<span class="org-comment-delimiter">// </span><span class="org-comment">&#20351;&#29992; DataSet &#24418;&#24335;&#30340;&#25968;&#25454;</span>
<span class="org-keyword">const</span> <span class="org-variable-name">dataset</span> = {
    legend: {},
    tooltip: {},
    dataset: {
        source: [
            [<span class="org-string">'product'</span>, <span class="org-string">'2015'</span>, <span class="org-string">'2016'</span>, <span class="org-string">'2017'</span>],
            [<span class="org-string">'Matcha Latte'</span>, 43.3, 85.8, 93.7],
            [<span class="org-string">'Milk Tea'</span>, 83.1, 73.4, 55.1],
            [<span class="org-string">'Cheese Cocoa'</span>, 86.4, 65.2, 82.5],
            [<span class="org-string">'Walnut Brownie'</span>, 72.4, 53.9, 39.1]
        ]
    },
    xAxis: { type: <span class="org-string">'category'</span> },
    yAxis: {},
    series: [
        {type: <span class="org-string">'bar'</span>},
        {type: <span class="org-string">'bar'</span>},
        {type: <span class="org-string">'bar'</span>}
    ]
};

<span class="org-comment-delimiter">// </span><span class="org-comment">&#20351;&#29992; setOption &#24320;&#21551;&#28210;&#26579;</span>
myChart.setOption(dataset);
</pre>
</div>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: unname</p>
<p class="date">Created: 2019-03-22 周五 01:30</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
